app/views/projects/show.html.erb

<%# ---------------------------------Bugs %>
<%if @project.bugs.count != 0 %>
---
SELECT COUNT(*) FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 4]]