app/controllers/bugs_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @bug = Bug.all()
    @project = Project.find_by(id: params[:project_id])

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_bug
    @bug = Bug.find(params[:id])