app/models/ability.rb

  def initialize(current_user)

      current_user||=User.new
      if current_user.usertype=='manager'
       # can :manage, :all
      # can :create, Project
      # can :create, Project , current_user
      # can :create , Project ,current_user.id
        can :create, Project
        can :read, Project, creator_id: current_user.id
        can :edit, Project, creator_id: current_user.id
        can :destroy, Project, creator_id: current_user.id
        can :read, Bug, creator_id: current_user.id
        # can :read ,User ,creator_id: current_user.id
        can :read, User, id: current_user.id
      elsif current_user.usertype == 'developer'
        can :read,Project do |project|
          project.users.include? (current_user)
        end
        can :read, Bug, solver_id: current_user.id
        can :update, Bug, solver_id: current_user.id
        can :read, User, id: current_user.id
      elsif current_user.usertype=='qa'
        can :read, Project do |project|
          project.users.include? (current_user)
---
SELECT 1 AS one FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 4], ["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 5], ["id", 3], ["LIMIT", 1]]